@rabru  Issue is fixed and pushed the commit to master branch, can you clone the latest master branch and try it out ?

Bigip version : v15

resource "bigip_ltm_profile_http" "myhttp" {
  name                  = "/Common/my-http"
  defaults_from         = "/Common/http"
}

$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_ltm_profile_http.test-http will be created
  + resource "bigip_ltm_profile_http" "test-http" {
      + accept_xff                 = (known after apply)
      + basic_auth_realm           = (known after apply)
      + defaults_from              = "/Common/http"
      + description                = (known after apply)
      + fallback_host              = (known after apply)
      + head_erase                 = (known after apply)
      + head_insert                = (known after apply)
      + id                         = (known after apply)
      + insert_xforwarded_for      = (known after apply)
      + lws_separator              = (known after apply)
      + name                       = "/Common/test-http"
      + oneconnect_transformations = (known after apply)
      + proxy_type                 = (known after apply)
      + redirect_rewrite           = (known after apply)
      + request_chunking           = (known after apply)
      + response_chunking          = (known after apply)
      + response_headers_permitted = (known after apply)
      + server_agent_name          = (known after apply)
      + via_host_name              = (known after apply)
      + via_request                = (known after apply)
      + via_response               = (known after apply)
      + xff_alternative_names      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_ltm_profile_http.test-http: Creating...
bigip_ltm_profile_http.test-http: Creation complete after 3s [id=/Common/test-http]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
$ terraform destroy
bigip_ltm_profile_http.test-http: Refreshing state... [id=/Common/test-http]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # bigip_ltm_profile_http.test-http will be destroyed
  - resource "bigip_ltm_profile_http" "test-http" {
      - defaults_from              = "/Common/http" -> null
      - id                         = "/Common/test-http" -> null
      - name                       = "/Common/test-http" -> null
      - response_headers_permitted = [] -> null
      - xff_alternative_names      = [] -> null
    }

Plan: 0 to add, 0 to change, 1 to destroy.

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

bigip_ltm_profile_http.test-http: Destroying... [id=/Common/test-http]
bigip_ltm_profile_http.test-http: Destruction complete after 0s

Destroy complete! Resources: 1 destroyed.







